//HERC01C  JOB  CLASS=A,MSGCLASS=X
//*
//* JOB020
//* FORMAT THE NJE38 NETSPOOL DATASET
//*
//* VERIFY THE NJE38 AUTHLIB AND NETSPOOL DATASET NAMES.
//*
//*
//FMT      EXEC PGM=NJEFMT
//STEPLIB  DD DISP=SHR,DSN=NJE38.AUTHLIB                  <== VERIFY
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//NETSPOOL DD DISP=OLD,DSN=NJE38.NETSPOOL                 <== VERIFY
//
